docs/site/hunter04_guitar_effec_pedal_pract_handb.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>hunter04_guitar_effec_pedal_pract_handb</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">hunter04_guitar_effec_pedal_pract_handb</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6f38174">Chapter 2 Effects Explained</a>
<ul>
<li><a href="#org20cf575">Page 20</a>
<ul>
<li><a href="#org09371fa">Boost Compression Distortion &amp; Fuzz</a></li>
</ul>
</li>
<li><a href="#org7dce322">page 23</a>
<ul>
<li><a href="#org604fbf6">Boosters</a></li>
</ul>
</li>
<li><a href="#org366fbcb">page 24</a>
<ul>
<li><a href="#org00017c5">Compressors</a></li>
</ul>
</li>
<li><a href="#org88dbc70">page 25</a>
<ul>
<li><a href="#org2a37b7d">Overdrives</a></li>
</ul>
</li>
<li><a href="#org19fd206">page 26</a></li>
<li><a href="#orga8913b8">page 27</a>
<ul>
<li><a href="#org4a139d0">Distortions</a></li>
</ul>
</li>
<li><a href="#org94c1f18">page 28</a>
<ul>
<li><a href="#org264f06c">Fuzz</a></li>
</ul>
</li>
<li><a href="#org53ccc18">page 29</a></li>
<li><a href="#orgb90c99c">page 30</a>
<ul>
<li><a href="#org048f183">Modulation</a></li>
<li><a href="#org3bcbfad">Phasing</a></li>
</ul>
</li>
<li><a href="#org93f9924">page 32</a>
<ul>
<li><a href="#orgf4dee98">Flanging</a></li>
</ul>
</li>
<li><a href="#org47f9bca">page 33</a>
<ul>
<li><a href="#orgf0a28cd">Chorus</a></li>
</ul>
</li>
<li><a href="#org5a3cfd6">page 34</a>
<ul>
<li><a href="#org7e2abf6">Vibrato &amp; Tremolo</a></li>
</ul>
</li>
<li><a href="#org8b2bd74">page 35</a>
<ul>
<li><a href="#org3846502">Octave Divider</a></li>
</ul>
</li>
<li><a href="#orga3865ed">page 36</a>
<ul>
<li><a href="#org2b9e822">Ring Modulators</a></li>
</ul>
</li>
<li><a href="#org606c6a6">page 37</a>
<ul>
<li><a href="#orgac8ca86">Echo &amp; Delay</a></li>
<li><a href="#orgfd0519b">Analog Delay</a></li>
</ul>
</li>
<li><a href="#org7123672">page 38</a>
<ul>
<li><a href="#org82e10ec">Digital Delay</a></li>
</ul>
</li>
<li><a href="#org6721e09">page 39</a>
<ul>
<li><a href="#org75cb436">Reverb</a></li>
</ul>
</li>
<li><a href="#org8f91c7c">page 40</a>
<ul>
<li><a href="#org16ce2cf">Filtering and EQ</a></li>
<li><a href="#org19b9cf1">Wah wah</a></li>
</ul>
</li>
<li><a href="#orgfee4389">page 42</a>
<ul>
<li><a href="#org4ccfda5">Auto wah</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga5fc25e">Chapter 5 Tips and Tricks</a>
<ul>
<li><a href="#org2e87b31">page 139</a>
<ul>
<li><a href="#orgd4ca27a">Standard pedal order</a></li>
</ul>
</li>
<li><a href="#orge29413c">page 140</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org6f38174" class="outline-2">
<h2 id="org6f38174">Chapter 2 Effects Explained</h2>
<div class="outline-text-2" id="text-org6f38174">
</div>
<div id="outline-container-org20cf575" class="outline-3">
<h3 id="org20cf575">Page 20</h3>
<div class="outline-text-3" id="text-org20cf575">
<p>
4 broad headings
</p>
<ol class="org-ol">
<li>Boost, compression, distortion, fuzz</li>
<li>modulation</li>
<li>Echo &amp; Delay</li>
<li>Filtering and EQ</li>
</ol>
</div>
<div id="outline-container-org09371fa" class="outline-4">
<h4 id="org09371fa">Boost Compression Distortion &amp; Fuzz</h4>
<div class="outline-text-4" id="text-org09371fa">
<p>
usually one of the first pedals that people own, as it is the easiest and change to the pure unaffected sound
</p>
</div>
</div>
</div>
<div id="outline-container-org7dce322" class="outline-3">
<h3 id="org7dce322">page 23</h3>
<div class="outline-text-3" id="text-org7dce322">
</div>
<div id="outline-container-org604fbf6" class="outline-4">
<h4 id="org604fbf6">Boosters</h4>
<div class="outline-text-4" id="text-org604fbf6">
<p>
Preamp boosters often called linear, clean, or distortion free boosters
Purpose is to increase the signal, not change the frequency range or change tone in any way
most use it to get the tube amp distortion sound at lower levels
</p>
</div>
</div>
</div>
<div id="outline-container-org366fbcb" class="outline-3">
<h3 id="org366fbcb">page 24</h3>
<div class="outline-text-3" id="text-org366fbcb">
</div>
<div id="outline-container-org00017c5" class="outline-4">
<h4 id="org00017c5">Compressors</h4>
<div class="outline-text-4" id="text-org00017c5">
<p>
smooth the attack and decay by softeining the front edge and boosting the tail
not always super apparent in the sound, but some again use it to change what the tube amp sounds like
some compressors thicken the tone a little bit
</p>
</div>
</div>
</div>
<div id="outline-container-org88dbc70" class="outline-3">
<h3 id="org88dbc70">page 25</h3>
<div class="outline-text-3" id="text-org88dbc70">
<p>
overuse will take out all the dynamics as everything is squished together
</p>
</div>
<div id="outline-container-org2a37b7d" class="outline-4">
<h4 id="org2a37b7d">Overdrives</h4>
</div>
</div>
<div id="outline-container-org19fd206" class="outline-3">
<h3 id="org19fd206">page 26</h3>
<div class="outline-text-3" id="text-org19fd206">
<p>
overdrive boosts the signal to get the tube amp to distort, or emulates an overdriven tube amp
the difference between overdrive and distortions is how it treats the signal when it clips. Overdrive is a soft clip and distortion is a hard clip
sound is 'natural' 'warm' and 'tubey' because of symettrical clipping and reducing high harmonics
</p>
</div>
</div>
<div id="outline-container-orga8913b8" class="outline-3">
<h3 id="orga8913b8">page 27</h3>
<div class="outline-text-3" id="text-orga8913b8">
<p>
designed to be used with a tube amp, and so can sound cold without one
</p>
</div>
<div id="outline-container-org4a139d0" class="outline-4">
<h4 id="org4a139d0">Distortions</h4>
<div class="outline-text-4" id="text-org4a139d0">
<p>
serious adulteration of the guitar's signal
</p>
</div>
</div>
</div>
<div id="outline-container-org94c1f18" class="outline-3">
<h3 id="org94c1f18">page 28</h3>
<div class="outline-text-3" id="text-org94c1f18">
<p>
may sound more like it's supposed to going straight into a mixer
</p>
</div>
<div id="outline-container-org264f06c" class="outline-4">
<h4 id="org264f06c">Fuzz</h4>
</div>
</div>
<div id="outline-container-org53ccc18" class="outline-3">
<h3 id="org53ccc18">page 29</h3>
<div class="outline-text-3" id="text-org53ccc18">
<p>
puts a distrotion through the entire range, affects the sound the most, but can be retain more elements of dynamics, touch, feel and the core tonality
</p>
</div>
</div>
<div id="outline-container-orgb90c99c" class="outline-3">
<h3 id="orgb90c99c">page 30</h3>
<div class="outline-text-3" id="text-orgb90c99c">
</div>
<div id="outline-container-org048f183" class="outline-4">
<h4 id="org048f183">Modulation</h4>
<div class="outline-text-4" id="text-org048f183">
<p>
includes pahsing, flanging, chorus, vibrato, tremolo, rotary speaker effects, and octave dividers
</p>
</div>
</div>
<div id="outline-container-org3bcbfad" class="outline-4">
<h4 id="org3bcbfad">Phasing</h4>
<div class="outline-text-4" id="text-org3bcbfad">
<p>
copy the sound and make one signal be out of phase with the original. When they are 180 degrees out of phase they cancel each other out and you get a notch. It has a swooshing sound
generally 4 stages of phasing, so 0 to 720 degrees with 3 peaks and 2 notches
</p>
</div>
</div>
</div>
<div id="outline-container-org93f9924" class="outline-3">
<h3 id="org93f9924">page 32</h3>
<div class="outline-text-3" id="text-org93f9924">
</div>
<div id="outline-container-orgf4dee98" class="outline-4">
<h4 id="orgf4dee98">Flanging</h4>
<div class="outline-text-4" id="text-orgf4dee98">
<p>
flangers are similar to phasers, but try to impose more control over the notches in the phase relationship. They can have hundreds of stages to the phasing
</p>
</div>
</div>
</div>
<div id="outline-container-org47f9bca" class="outline-3">
<h3 id="org47f9bca">page 33</h3>
<div class="outline-text-3" id="text-org47f9bca">
<p>
often less used than a phaser because it's a bit much. Mostly used in background stuff it claims
</p>
</div>
<div id="outline-container-orgf0a28cd" class="outline-4">
<h4 id="orgf0a28cd">Chorus</h4>
<div class="outline-text-4" id="text-orgf0a28cd">
<p>
really a delay, but sonically it's to change the tone so it fits in modulation
like a flanger but changes where the modulation is happening to a specific spectrum that eliminates most of the swooshing
best heard perhaps in stereo
</p>
</div>
</div>
</div>
<div id="outline-container-org5a3cfd6" class="outline-3">
<h3 id="org5a3cfd6">page 34</h3>
<div class="outline-text-3" id="text-org5a3cfd6">
<p>
digital chorus copies the signal, delays and pitch modulates just a little bit so it sounds like different players
</p>
</div>
<div id="outline-container-org7e2abf6" class="outline-4">
<h4 id="org7e2abf6">Vibrato &amp; Tremolo</h4>
<div class="outline-text-4" id="text-org7e2abf6">
<p>
vibrato wavers the sound a little above and below. It is best used subtly
tremelo is rapid on off states that alternate
</p>
</div>
</div>
</div>
<div id="outline-container-org8b2bd74" class="outline-3">
<h3 id="org8b2bd74">page 35</h3>
<div class="outline-text-3" id="text-org8b2bd74">
</div>
<div id="outline-container-org3846502" class="outline-4">
<h4 id="org3846502">Octave Divider</h4>
</div>
</div>
<div id="outline-container-orga3865ed" class="outline-3">
<h3 id="orga3865ed">page 36</h3>
<div class="outline-text-3" id="text-orga3865ed">
<p>
adds extra images of a note, doesn't work as well with harmonics or intervals
</p>
</div>
<div id="outline-container-org2b9e822" class="outline-4">
<h4 id="org2b9e822">Ring Modulators</h4>
<div class="outline-text-4" id="text-org2b9e822">
<p>
Takes the original sound and multiplies with a carrier signal. This could be internally controlled or come from another source
</p>
</div>
</div>
</div>
<div id="outline-container-org606c6a6" class="outline-3">
<h3 id="org606c6a6">page 37</h3>
<div class="outline-text-3" id="text-org606c6a6">
<p>
the result is mathematical, with no harmonic relationship to the orinigal sound. Some pedals take a little of the original to mix back in with it to keep some of the sound.
</p>
</div>
<div id="outline-container-orgac8ca86" class="outline-4">
<h4 id="orgac8ca86">Echo &amp; Delay</h4>
<div class="outline-text-4" id="text-orgac8ca86">
<p>
Really the same thing used differnetly
</p>
</div>
</div>
<div id="outline-container-orgfd0519b" class="outline-4">
<h4 id="orgfd0519b">Analog Delay</h4>
</div>
</div>
<div id="outline-container-org7123672" class="outline-3">
<h3 id="org7123672">page 38</h3>
<div class="outline-text-3" id="text-org7123672">
<p>
input to output pin with anything from 68 to 4096 stages
</p>
</div>
<div id="outline-container-org82e10ec" class="outline-4">
<h4 id="org82e10ec">Digital Delay</h4>
<div class="outline-text-4" id="text-org82e10ec">
<p>
made it possible to have longer delay times
most decided after the novelty that there was not much use for delays longer than 2 seconds
</p>
</div>
</div>
</div>
<div id="outline-container-org6721e09" class="outline-3">
<h3 id="org6721e09">page 39</h3>
<div class="outline-text-3" id="text-org6721e09">
</div>
<div id="outline-container-org75cb436" class="outline-4">
<h4 id="org75cb436">Reverb</h4>
<div class="outline-text-4" id="text-org75cb436">
<p>
approximates the sound when played in an empty reflective room
most powerful digital reverbs are rack units
</p>
</div>
</div>
</div>
<div id="outline-container-org8f91c7c" class="outline-3">
<h3 id="org8f91c7c">page 40</h3>
<div class="outline-text-3" id="text-org8f91c7c">
</div>
<div id="outline-container-org16ce2cf" class="outline-4">
<h4 id="org16ce2cf">Filtering and EQ</h4>
<div class="outline-text-4" id="text-org16ce2cf">
<p>
filtering certain frequencies of the sound for emotive effects
</p>
</div>
</div>
<div id="outline-container-org19b9cf1" class="outline-4">
<h4 id="org19b9cf1">Wah wah</h4>
<div class="outline-text-4" id="text-org19b9cf1">
<p>
wah circuit is a sweepiable peaking filter, it's a bandpass filter that adds in other notes as the pedal is pressed towards the peak, which gives the wah effect
</p>
</div>
</div>
</div>
<div id="outline-container-orgfee4389" class="outline-3">
<h3 id="orgfee4389">page 42</h3>
<div class="outline-text-3" id="text-orgfee4389">
</div>
<div id="outline-container-org4ccfda5" class="outline-4">
<h4 id="org4ccfda5">Auto wah</h4>
<div class="outline-text-4" id="text-org4ccfda5">
<p>
enevelope follower, or voltage controlled filter, or autowah
Makes the initial attack, the picking (or tonguing) affect the swoop of the filter
Soft attacks will sound bassy and muted, and loud attacks get the wah sound
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orga5fc25e" class="outline-2">
<h2 id="orga5fc25e">Chapter 5 Tips and Tricks</h2>
<div class="outline-text-2" id="text-orga5fc25e">
</div>
<div id="outline-container-org2e87b31" class="outline-3">
<h3 id="org2e87b31">page 139</h3>
<div class="outline-text-3" id="text-org2e87b31">
</div>
<div id="outline-container-orgd4ca27a" class="outline-4">
<h4 id="orgd4ca27a">Standard pedal order</h4>
<div class="outline-text-4" id="text-orgd4ca27a">
<p>
Filters and EQs first, boosters and overdrives second, modulation third, and delays fourth
a common swap is to flip the middle two
</p>
</div>
</div>
</div>
<div id="outline-container-orge29413c" class="outline-3">
<h3 id="orge29413c">page 140</h3>
<div class="outline-text-3" id="text-orge29413c">
<p>
wah wah likes to go first
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
